#### Terraform Plan for DEV Environment 🚀

<details><summary>Show Plan</summary>

```
module.firebase.data.google_project.main: Reading...
data.google_client_config.current: Reading...
data.google_project.branubrain_fs: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"branubrain-fs"/regions/"asia-northeast1"/zones/<null>]
data.google_project.branubrain_fs: Read complete after 0s [id=projects/branubrain-fs]
module.firebase.data.google_project.main: Read complete after 0s [id=projects/branubrain-fs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_run.google_artifact_registry_repository.main will be created
  + resource "google_artifact_registry_repository" "main" {
      + create_time      = (known after apply)
      + description      = "Docker repository for branubrain-fs-dev"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "branubrain-fs"
      + repository_id    = "branubrain-fs-dev"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # module.cloud_run.google_cloud_run_service.main will be created
  + resource "google_cloud_run_service" "main" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "branubrain-fs-dev"
      + project                    = "branubrain-fs"
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"         = "10"
                  + "run.googleapis.com/execution-environment" = "gen2"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/branubrain-fs/branubrain-fs-dev/backend-dev"
                  + name  = (known after apply)

                  + ports {
                      + container_port = 8000
                      + name           = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "2000m"
                          + "memory" = "1Gi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.cloud_run.google_project_service.cloud_run_apis["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "cloud_run_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "branubrain-fs"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.cloud_run.google_project_service.cloud_run_apis["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "cloud_run_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "branubrain-fs"
      + service                    = "containerregistry.googleapis.com"
    }

  # module.cloud_run.google_project_service.cloud_run_apis["run.googleapis.com"] will be created
  + resource "google_project_service" "cloud_run_apis" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "branubrain-fs"
      + service                    = "run.googleapis.com"
    }

  # module.cloud_run.google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "branubrain-fs-dev"
      + description  = "Service account for Cloud Run service branubrain-fs-dev"
      + disabled     = false
      + display_name = "Cloud Run Service Account for branubrain-fs-dev"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "branubrain-fs"
      + unique_id    = (known after apply)
    }

  # module.firebase.google_firebase_hosting_site.main will be created
  + resource "google_firebase_hosting_site" "main" {
      + default_url = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "branubrain-fs"
      + site_id     = "branubrain-fs-development"
    }

  # module.firebase.google_firebase_project.main will be created
  + resource "google_firebase_project" "main" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "branubrain-fs"
      + project_number = (known after apply)
    }

  # module.firebase.google_project_service.firebase_apis["firebase.googleapis.com"] will be created
  + resource "google_project_service" "firebase_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "branubrain-fs"
      + service            = "firebase.googleapis.com"
    }

  # module.firebase.google_project_service.firebase_apis["firebasehosting.googleapis.com"] will be created
  + resource "google_project_service" "firebase_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "branubrain-fs"
      + service            = "firebasehosting.googleapis.com"
    }

  # module.storage.google_storage_bucket.main will be created
  + resource "google_storage_bucket" "main" {
      + effective_labels            = {
          + "environment" = "development"
          + "managed_by"  = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "development"
          + "managed_by"  = "terraform"
        }
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "branubrain-fs-development-storage"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment" = "development"
          + "managed_by"  = "terraform"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Target: `dev` environment | Pusher: @shiroishi761*